УТ_для_edt.ДоставкаДеловыеЛинии/src/Documents/ДЛ_ЗаявкаНаДоставку/ДЛ_ЗаявкаНаДоставку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДЛ_ЗаявкаНаДоставку</name>
  <basedOn>Document.ВозвратТоваровПоставщику</basedOn>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.ЗаявкаНаВозвратТоваровОтКлиента</basedOn>
  <basedOn>Document.ПриобретениеТоваровУслуг</basedOn>
  <basedOn>Document.ЗаказНаПеремещение</basedOn>
  <basedOn>Document.ПеремещениеТоваров</basedOn>
  <basedOn>Document.КорректировкаРеализации</basedOn>
  <basedOn>Document.ТранспортнаяНакладная</basedOn>
  <basedOn>Document.РасходныйОрдерНаТовары</basedOn>
  <basedOn>Document.ПриходныйОрдерНаТовары</basedOn>
  <basedOn>Document.КорректировкаПриобретения</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ЗаказНаПеремещение</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.РасходныйОрдерНаТовары</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.КорректировкаПриобретения</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.КорректировкаРеализации</types>
        <types>DocumentRef.ТранспортнаяНакладная</types>
        <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
        <types>DocumentRef.ПриходныйОрдерНаТовары</types>
        <types>DocumentRef.ПоступлениеТоваровНаСклад</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
        <types>DocumentRef.ЗаказКлиента</types>
        <types>DocumentRef.ПеремещениеТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.ДоставкаДеловыеЛинии/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8d080f3c-06ed-48bf-9709-eea73d676741">
  <name>ТипыКонтактнойИнформации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="57b31a5d-9fdc-43d2-ae81-67157822c4b6">
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.ДоставкаДеловыеЛинии/src/Catalogs/КонтактныеЛицаПартнеров/КонтактныеЛицаПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="877a04b6-4c0b-4715-b826-6ac77909e040">
  <name>КонтактныеЛицаПартнеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="65059fcf-d30d-4366-aabc-1736a2a1198c">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="89012594-b147-4b78-877f-5aab7931b40e">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d228be44-cb90-454d-a57c-16fc89dd78ba">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b63093be-8b18-45db-919f-2d2f35cdb506">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.ДоставкаДеловыеЛинии/src/Documents/ДЛ_ЗаявкаНаДоставку/Forms/ИзменениеЗаказа/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  	
	
	Параметры.Свойство("НомерЗаказа", НомерЗаказа); 
	Параметры.Свойство("ОтправительКонтактноеЛицоНаименование", ОтправительКонтактноеЛицоНаименование);
	Параметры.Свойство("ОтправительКонтактноеЛицоТелефонПредставление", ОтправительКонтактноеЛицоТелефонПредставление); 
	Параметры.Свойство("ДоставкаДоАдреса", ДоставкаДоАдреса);
	
	Если Не ЗначениеЗаполнено(НомерЗаказа) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не передан номер заказа");
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
	Элементы.грПолучатель.Видимость = Параметры.Свойство("Получатель"); 
	Элементы.грПлательщик.Видимость = Параметры.Свойство("Плательщик");
	Элементы.грКонтактнаяИнформацияОтправитель.Видимость = Параметры.Свойство("КонтактнаяИнформацияОтправитель");
	Элементы.грКонтактнаяИнформацияПолучатель.Видимость = Параметры.Свойство("КонтактнаяИнформацияПолучатель");
	Элементы.грАдресВремяЗабора.Видимость = Параметры.Свойство("АдресВремяЗабора");
	Элементы.грАдресВремяДоставки.Видимость = Параметры.Свойство("АдресВремяДоставки");
	Элементы.грПриостановка.Видимость = Параметры.Свойство("Приостановка");
	Элементы.грВозобновление.Видимость = Параметры.Свойство("Возобновление");
	Элементы.грОтменаЗабора.Видимость = Параметры.Свойство("ОтменаЗабора");
	Элементы.грОтменаДоставки.Видимость = Параметры.Свойство("ОтменаДоставки"); 
	
	Если Элементы.грАдресВремяДоставки.Видимость Тогда
		
		Элементы.ПолучательАдрес.Видимость = ДоставкаДоАдреса;
		Элементы.ПолучательВремяПлановойДоставки.Видимость = ДоставкаДоАдреса; 
		Элементы.ПолучательДатаПлановойДоставки.Видимость = ДоставкаДоАдреса;
		Элементы.ПолучательТерминал.Видимость = Не ДоставкаДоАдреса;
		
	КонецЕсли;
	
	Если Элементы.грПриостановка.Видимость Тогда
		
		Элементы.ИнформацияПриостановка.Заголовок = Параметры.Приостановка;
		
	КонецЕсли; 
	
	Если Элементы.грВозобновление.Видимость Тогда
		
		Элементы.ИнформацияВозобновление.Заголовок = Параметры.Возобновление;
		
	КонецЕсли;	
	
КонецПроцедуры 

&НаКлиенте
Процедура ПолучательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	НачалоВыбораУчастникаГрузоперевозки("ПолучательКонтрагентСсылка");	
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораУчастникаГрузоперевозки(УчастникГрузоперевозки)
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("Организация", 	"Справочник: Организации"); 
	СписокВыбора.Добавить("Контрагент",		"Справочник: Контрагенты");	 
	
	ОО = Новый ОписаниеОповещения("НачалоВыбораУчастникаГрузоперевозкиПродолжить", ЭтаФорма, УчастникГрузоперевозки);  
	
	СписокВыбора.ПоказатьВыборЭлемента(ОО, "Выберите способ заполнения данных");	
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораУчастникаГрузоперевозкиПродолжить(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ИмяРеквизита = СтрЗаменить(ДополнительныеПараметры, "Ссылка", ""); 
		ИмяРеквизитаИНН = ИмяРеквизита + "ИНН"; 
		
		Если Результат.Значение = "Вручную" Тогда	
			
			Элементы[ИмяРеквизитаИНН].ТолькоПросмотр = Ложь;
			Элементы[ИмяРеквизита].РедактированиеТекста = Истина; 
			Элементы[ИмяРеквизита].КнопкаОткрытия = Ложь; 
			ЭтотОбъект[ДополнительныеПараметры] = Неопределено;
			
		Иначе  
			
			Элементы[ИмяРеквизитаИНН].ТолькоПросмотр = Истина;
			Элементы[ИмяРеквизита].РедактированиеТекста = Ложь;
			Элементы[ИмяРеквизита].КнопкаОткрытия = Истина;
			
			ПараметрыОткрытия = Новый Структура;			
			ПараметрыОткрытия.Вставить("РежимВыбора", Истина); 
			
			ОО = Новый ОписаниеОповещения("ОбработатьВыборЗначения", ЭтотОбъект, ДополнительныеПараметры);
			
			Если Результат.Значение = "Организация" Тогда 
				
				ИмяФормыВыбора = "Справочник.Организации.ФормаВыбора";				
				
			ИначеЕсли Результат.Значение = "Контрагент" Тогда
				
				ИмяФормыВыбора = "Справочник.Контрагенты.ФормаВыбора";
				
			Иначе
				
				Возврат;
				
			КонецЕсли; 
			
			ОткрытьФорму(ИмяФормыВыбора, ПараметрыОткрытия,	ЭтаФорма,,,, ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборЗначения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Или
		(ТипЗнч(Результат) = Тип("КодВозвратаДиалога")
		И Результат = КодВозвратаДиалога.Отмена) Тогда
		
		Возврат;
		
	КонецЕсли; 	
	
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда	
		
		ЭтотОбъект[ДополнительныеПараметры] = Результат;
		
		ОбработатьИзменениеРеквизитаФормы(ДополнительныеПараметры);
		
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеРеквизитаФормы(ИмяРеквизита)
	
	Отказ = Ложь;
	ОбработатьИзменениеРеквизитаФормыНаСервере(ИмяРеквизита, Отказ);			
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеРеквизитаФормыНаСервере(ИмяРеквизита, Отказ = Ложь)
	
	Модифицированность = Истина;
	
	Если ИмяРеквизита = "ОтправительКонтрагентСсылка" 
		ИЛИ ИмяРеквизита = "ПолучательКонтрагентСсылка"
		ИЛИ ИмяРеквизита = "ПлательщикКонтрагентСсылка" Тогда
		
		ПараметрыУчастника = ПараметрыУчастникаГрузоперевозки(ЭтотОбъект[ИмяРеквизита]);		
		
		ОбработатьПараметры(ПараметрыУчастника, СтрЗаменить(ИмяРеквизита, "КонтрагентСсылка", ""));							
					
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ОбработатьПараметры(Параметры, Префикс = "")
	
	ПараметрыДляФормы = Новый Структура;
	
	ЗаполнитьЛинейныеДанныеПоСтруктуре(Параметры, ПараметрыДляФормы, Префикс);		
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ПараметрыДляФормы);	 
	
	ЭтотОбъект[Префикс + "КонтактноеЛицоНаименование"] = "";
	ЭтотОбъект[Префикс + "КонтактноеЛицоТелефонПредставление"] = "";
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьЛинейныеДанныеПоСтруктуре(Параметры, Данные, Префикс = "") Экспорт
	
	Для Каждого Параметр Из Параметры Цикл 
		
		ИмяКолонки = Префикс + Параметр.Ключ; 
		
		Если ТипЗнч(Параметр.Значение) = Тип("Структура") Тогда  
			
			ЗаполнитьЛинейныеДанныеПоСтруктуре(Параметр.Значение, Данные, ИмяКолонки);
			
		Иначе  
			
			Данные.Вставить(ИмяКолонки, Параметры[Параметр.Ключ]); 
			
		КонецЕсли;  
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НовыйПараметрыУчастникаГрузоперевозки() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Контрагент", НовыйПараметрыКонтрагента());	
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПараметрыУчастникаГрузоперевозки(Значение)
	
	ПараметрыУчастника = НовыйПараметрыУчастникаГрузоперевозки();
	
	ПараметрыУчастника.Контрагент = ПараметрыКонтрагента(Значение);		
		
	Возврат ПараметрыУчастника;
	
КонецФункции  

&НаСервереБезКонтекста
Функция ПараметрыКонтрагента(Значение)
	
	ПараметрыКонтрагента = НовыйПараметрыКонтрагента();
	ПараметрыКонтрагента.Ссылка = Значение;
	
	Если ЗначениеЗаполнено(Значение) Тогда 
		
		ЗаполнитьПараметрыКонтрагента(ПараметрыКонтрагента);		
		
	КонецЕсли;
	
	Возврат ПараметрыКонтрагента;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьПараметрыКонтрагента(ПараметрыКонтрагента) Экспорт
	
	ИмяСправочника = Неопределено;
	Если ТипЗнч(ПараметрыКонтрагента.Ссылка) = Тип("СправочникСсылка.Организации") Тогда
		ИмяСправочника = "Организации";
		РеквизитНаименования = "ОсновнаяТаблица.НаименованиеСокращенное";
		ПараметрыКонтрагента.ЭтоОрганизация = Истина;
	ИначеЕсли ТипЗнч(ПараметрыКонтрагента.Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		ИмяСправочника = "Контрагенты";
		РеквизитНаименования = "ОсновнаяТаблица.НаименованиеПолное";
		ПараметрыКонтрагента.ЭтоОрганизация = Ложь;
	Иначе
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ОсновнаяТаблица.Ссылка КАК Ссылка,
	               |	ОсновнаяТаблица.ИНН КАК ИНН,
	               |	ОсновнаяТаблица.КПП КАК КПП,
	               |	&РеквизитНаименования КАК Наименование,
	               |	ВЫБОР
	               |		КОГДА ОсновнаяТаблица.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА 1
	               |		КОГДА ОсновнаяТаблица.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА 2
	               |		КОГДА ОсновнаяТаблица.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЮрФизЛицо
	               |ИЗ
	               |	&ТаблицаДляЗапроса КАК ОсновнаяТаблица
	               |ГДЕ
	               |	ОсновнаяТаблица.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрыКонтрагента.Ссылка);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаДляЗапроса", "Справочник." + ИмяСправочника);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РеквизитНаименования", РеквизитНаименования);
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда  
		
		ЗаполнитьЗначенияСвойств(ПараметрыКонтрагента, РезультатЗапроса.Выгрузить()[0]);		
		
		Если ПараметрыКонтрагента.ЮрФизЛицо <> 2 Тогда
			
			ВидКИ = ?(ИмяСправочника = "Организации", Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
			
			ПараметрыКонтрагента.ЮридическийАдресПредставление = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПараметрыКонтрагента.Ссылка, ВидКИ, ТекущаяДата(), Истина); 			
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НовыйПараметрыКонтрагента() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Ссылка", Неопределено);
	Результат.Вставить("Наименование", "");
	Результат.Вставить("ЮрФизЛицо", 0);
	Результат.Вставить("ИНН", "");
	Результат.Вставить("КПП", "");
	Результат.Вставить("ЮридическийАдресПредставление", "");
	Результат.Вставить("ЭтоОрганизация", Ложь);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПолучательОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтрагентОткрытие(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОткрытие(Элемент)
	
	ИмяРеквизита = Элемент.Имя + "Ссылка";
	ИмяРеквизитаЭтоОрганизация = Элемент.Имя + "ЭтоОрганизация";
	
	ЗначениеРеквизита = ЭтотОбъект[ИмяРеквизита];
	ЭтоОрганизация = ЭтотОбъект[ИмяРеквизитаЭтоОрганизация];
	
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда  
		
		ПараметрыОткрытия = Новый Структура("Ключ", ЭтотОбъект[ИмяРеквизита]);
		ОО = Новый ОписаниеОповещения("ОбработатьИзменениеРеквизитовОбъекта", ЭтотОбъект, ИмяРеквизита);		
		
		Если ЭтоОрганизация Тогда
			
			ИмяФормыКонтрагента = "Справочник.Организации.ФормаОбъекта"; 
			
		Иначе                                                      
			
			ИмяФормыКонтрагента = "Справочник.Контрагенты.ФормаОбъекта";
			
		КонецЕсли; 	
		
		ОткрытьФорму(ИмяФормыКонтрагента, ПараметрыОткрытия, ЭтаФорма,,,, ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательКонтактноеЛицоНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтактноеЛицоНачалоВыбора(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоНачалоВыбора(ИмяРеквизита) 
	
	ИмяРеквизитаКонтрагента = СтрЗаменить(ИмяРеквизита, "КонтактноеЛицо", "КонтрагентСсылка"); 
	
	ТипКонтрагента = ТипЗнч(ЭтотОбъект[ИмяРеквизитаКонтрагента]); 
	
	ОО = Новый ОписаниеОповещения("ВыборКонтактноеЛицоЗавершение", ЭтаФорма, ИмяРеквизита); 
	
	ПараметрыОткрытия = Новый Структура;			
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	
	Если ТипКонтрагента = Тип("СправочникСсылка.Контрагенты") Тогда
		
		ПараметрыОтбора = Новый Структура("Владелец", ДЛ_ДеловыеЛинии.ПолучитьЗначениеРеквизита(ЭтотОбъект[ИмяРеквизитаКонтрагента], "Партнер"));
		
		ПараметрыОткрытия.Вставить("Отбор", ПараметрыОтбора);
		
		ОткрытьФорму("Справочник.КонтактныеЛицаПартнеров.ФормаВыбора", ПараметрыОткрытия,	ЭтаФорма,,,, ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
		
	ИначеЕсли ТипКонтрагента = Тип("СправочникСсылка.Организации") Тогда  		 		
		
		ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыОткрытия,	ЭтаФорма,,,, ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКонтактноеЛицоЗавершение(Результат, ИмяРеквизита) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Если ТипЗнч(Результат) = Тип("ЭлементСпискаЗначений") Тогда
			
			Результат = Результат.Значение;	
			
		КонецЕсли;	
		
		ЭтотОбъект[ИмяРеквизита + "Наименование"] = СокрЛП(Результат);		
		ЭтотОбъект[ИмяРеквизита + "ТелефонПредставление"] = ПолучитьТелефоныКонтактногоЛица(Результат); 
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьТелефоныКонтактногоЛица(КонтактноеЛицо)
	
	Результат = "";
	
	Если ЗначениеЗаполнено(КонтактноеЛицо) Тогда
		
		Телефоны = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(КонтактноеЛицо, Перечисления.ТипыКонтактнойИнформации.Телефон, ТекущаяДата(), Ложь); 	  
		
		Результат = СтрСоединить(Телефоны.ВыгрузитьКолонку("Представление"), "; ");		 		 		
		
	КонецЕсли; 
	
	Возврат Результат;
	
Конецфункции

&НаСервере
Процедура ИзменитьПолучателяНаСервере()  
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("appkey");
	СтруктураПараметров.Вставить("sessionID");
	СтруктураПараметров.Вставить("orderID", НомерЗаказа);
	СтруктураПараметров.Вставить("receiver", ЗаполнитьПараметрУчастникПеревозки("Получатель")); 
	СтруктураПараметров.Вставить("changeOrderPayer", ПолучательНовыйПлательщик);  
	СтруктураПараметров.Вставить("storePayer", "sender");
	
	Результат = ДЛ_ДеловыеЛинии.ИзменитьПолучателяПлательщика(СтруктураПараметров, "ИзменитьПолучателя");
	
	ОбработатьОшибки(Результат["errors"], "грПолучатель");
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПолучателя(Команда)
	
	ИзменитьПолучателяНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьПлательщикаНаСервере() 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("appkey");
	СтруктураПараметров.Вставить("sessionID");
	СтруктураПараметров.Вставить("orderID", НомерЗаказа); 
	СтруктураПараметров.Вставить("third", ЗаполнитьПараметрУчастникПеревозки("Плательщик"));	
		
	Если ПлательщикКонтрагентЮрФизЛицо = 2 Тогда     
		
		ДанныеДляЭлектронногоЧека = Новый Структура;			
		
		Если ЗначениеЗаполнено(ПлательщикКонтактноеЛицоEmail) Тогда  
			
			ДанныеДляЭлектронногоЧека.Вставить("email", ПлательщикКонтактноеЛицоEmail);	
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПлательщикКонтактноеЛицоТелефонДляЧека) Тогда  
			
			ДанныеДляЭлектронногоЧека.Вставить("phone", ПлательщикКонтактноеЛицоТелефонДляЧека);	
			
		КонецЕсли;
		
		СтруктураПараметров.third.Вставить("dataForReceipt", ДанныеДляЭлектронногоЧека);
		
	КонецЕсли;
	
	Результат = ДЛ_ДеловыеЛинии.ИзменитьПолучателяПлательщика(СтруктураПараметров, "ИзменитьПлательщика");
	
	ОбработатьОшибки(Результат["errors"], "грПлательщик");	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПлательщика(Команда)  
	
	ИзменитьПлательщикаНаСервере(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикКонтактноеЛицоНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтактноеЛицоНачалоВыбора(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикКонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	НачалоВыбораУчастникаГрузоперевозки("ПлательщикКонтрагентСсылка");	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительАдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФормуВыбораАдреса("Отправитель");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораАдреса(Префикс)
	
	ИмяРеквизитаАдреса = Префикс + "Адрес";	
	
	ДополнительныеПараметры = Новый Структура;	
	ДополнительныеПараметры.Вставить("ИмяРеквизитаАдреса", ИмяРеквизитаАдреса);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьФормуВыбораАдресаИОбработатьРезультатЗавершение", 
		ЭтаФорма, ДополнительныеПараметры);
		
	ВидКонтактнойИнформации = Новый Структура;
	ВидКонтактнойИнформации.Вставить("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
	ВидКонтактнойИнформации.Вставить("ТолькоНациональныйАдрес", Ложь);
	ВидКонтактнойИнформации.Вставить("ВключатьСтрануВПредставление", Ложь);
	ВидКонтактнойИнформации.Вставить("СкрыватьНеактуальныеАдреса", Ложь);
		
	ПараметрыФормыКонтактнойИнформации = УправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(
			ВидКонтактнойИнформации,
			ЭтаФорма[ИмяРеквизитаАдреса + "Значение"],
			ЭтаФорма[ИмяРеквизитаАдреса + "Представление"]);
	
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыФормыКонтактнойИнформации,, Оповещение);
	
КонецПроцедуры    

&НаКлиенте	
Процедура ОткрытьФормуВыбораАдресаИОбработатьРезультатЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда  
		
		Возврат; 
		
	КонецЕсли;
	
	ИмяРеквизитаАдреса = ДополнительныеПараметры.ИмяРеквизитаАдреса;
	
	ЭтаФорма[ИмяРеквизитаАдреса + "Представление"] = Результат.Представление;
	ЭтаФорма[ИмяРеквизитаАдреса + "Значение"] = Результат.Значение;

КонецПроцедуры

&НаКлиенте
Процедура ПолучательАдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФормуВыбораАдреса("Получатель");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительВремяПлановойОтгрузкиОчистка(Элемент, СтандартнаяОбработка)
	
	ВремяОтгрузкиС = Неопределено;
	ВремяОтгрузкиПо = Неопределено;
	ВремяОтгрузкиОбедС = Неопределено;
	ВремяОтгрузкиОбедПо = Неопределено;
	ОтправительФиксированноеВремя = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяОтгрузкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбораВремениИДаты(1, Элемент.ТолькоПросмотр);
	
КонецПроцедуры  

&НаКлиенте
Процедура ОткрытьФормуВыбораВремениИДаты(ВариантВыбораВремени, ТолькоПросмотр)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборДатыВремени", ЭтаФорма);
	
	ПараметрыОткрытияФормы = Новый Структура;
	
	Если ВариантВыбораВремени = 1 Тогда
		
		ПараметрыОткрытияФормы.Вставить("Дата", ДатаОтгрузки);
		ПараметрыОткрытияФормы.Вставить("ВремяРаботыС", ВремяОтгрузкиС);
		ПараметрыОткрытияФормы.Вставить("ВремяРаботыПо", ВремяОтгрузкиПо);
		ПараметрыОткрытияФормы.Вставить("ВремяОбедС", ВремяОтгрузкиОбедС);  
		ПараметрыОткрытияФормы.Вставить("ВремяОбедПо", ВремяОтгрузкиОбедПо);
		ПараметрыОткрытияФормы.Вставить("ВариантВыбораВремени", 1);		
		ПараметрыОткрытияФормы.Вставить("ФиксированноеВремя", ОтправительФиксированноеВремя);		
		
	ИначеЕсли ВариантВыбораВремени = 2 Тогда
		
		ПараметрыОткрытияФормы.Вставить("Дата", ДатаДоставки);
		ПараметрыОткрытияФормы.Вставить("ВремяРаботыС", ВремяДоставкиС);
		ПараметрыОткрытияФормы.Вставить("ВремяРаботыПо", ВремяДоставкиПо);
		ПараметрыОткрытияФормы.Вставить("ВремяОбедС", ВремяДоставкиОбедС);  
		ПараметрыОткрытияФормы.Вставить("ВремяОбедПо", ВремяДоставкиОбедПо);
		ПараметрыОткрытияФормы.Вставить("ВариантВыбораВремени", 2);		
		ПараметрыОткрытияФормы.Вставить("ФиксированноеВремя", ПолучательФиксированноеВремя);		
		
	КонецЕсли;
	
	ПараметрыОткрытияФормы.Вставить("ТолькоПросмотр", ТолькоПросмотр);	
	
	ОткрытьФорму(
		"Документ.ДЛ_ЗаявкаНаДоставку.Форма.ВыборВремениПередачиГруза",
		ПараметрыОткрытияФормы,
		ЭтаФорма,,,, ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры 
	
	&НаКлиенте
Процедура ОбработатьВыборДатыВремени(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ВариантВыбораВремени = 0;
	Если Результат.Свойство("ВариантВыбораВремени", ВариантВыбораВремени) Тогда 
		Если ВариантВыбораВремени = 1 Тогда
			
			Результат.Свойство("ВремяРаботыС", ВремяОтгрузкиС);
			Результат.Свойство("ВремяРаботыПо", ВремяОтгрузкиПо);
			Результат.Свойство("ВремяОбедС", ВремяОтгрузкиОбедС);  
			Результат.Свойство("ВремяОбедПо", ВремяОтгрузкиОбедПо);			
			Результат.Свойство("ФиксированноеВремя", ОтправительФиксированноеВремя);			
			
			СформироватьПредставлениеВремениОтгрузки();
			
		ИначеЕсли ВариантВыбораВремени = 2 Тогда

			Результат.Свойство("ВремяРаботыС", ВремяДоставкиС);
			Результат.Свойство("ВремяРаботыПо", ВремяДоставкиПо);
			Результат.Свойство("ВремяОбедС", ВремяДоставкиОбедС);  
			Результат.Свойство("ВремяОбедПо", ВремяДоставкиОбедПо);			
			Результат.Свойство("ФиксированноеВремя", ПолучательФиксированноеВремя);			
			
			СформироватьПредставлениеВремениДоставки();
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	ПроверитьВремяОтгрузки(ЕстьОшибки, Истина);
	
КонецПроцедуры 

&НаКлиенте
Функция ПроверитьВремяОтгрузки(ЕстьОшибки, ВыводитьПредупреждения)
	
	ШагОшибки = 0;
	ТекущаяДата = ОбщегоНазначенияКлиент.ДатаСеанса();
	НачалоТекущегоДня = НачалоДня(ТекущаяДата);
	ТекущееВремя = Дата(1,1,1) + (ТекущаяДата - НачалоТекущегоДня);
	НачалоДняОтгрузки = НачалоДня(ДатаОтгрузки); 
	
	Если НачалоТекущегоДня = НачалоДняОтгрузки
		И ВремяОтгрузкиПо <> Дата(1,1,1,0,0,0)
		И ТекущееВремя > ВремяОтгрузкиПо Тогда
		ЕстьОшибки = Истина;
		Если ВыводитьПредупреждения Тогда
			ТекстОшибки = НСтр("ru = 'Невозможно оформить доставку на указанное время отгрузки. Время отгрузки меньше, чем текущее.';
			|en = 'Cannot register delivery for the specified shipment time. The shipment time is less than the current one.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,,"ОтправительВремяПлановойОтгрузки");
		КонецЕсли;
	КонецЕсли;
	
	Возврат ШагОшибки;
	
КонецФункции  

&НаКлиенте
Процедура СформироватьПредставлениеВремениОтгрузки()
	
	ВремяОтгрузкиПредставление = ПредставлениеДатыВремени(ДатаОтгрузки, 
									ВремяОтгрузкиС, 
									ВремяОтгрузкиПо, 
									ВремяОтгрузкиОбедС, 
									ВремяОтгрузкиОбедПо, 1);
									
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПредставлениеВремениДоставки()
	
	ВремяДоставкиПредставление = ПредставлениеДатыВремени(ДатаДоставки, 
									ВремяДоставкиС, 
									ВремяДоставкиПо, 
									ВремяДоставкиОбедС, 
									ВремяДоставкиОбедПо, 2);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеДатыВремени(ДатаДоставки, ВремяРаботыС, ВремяРаботыПо, ВремяОбедС, ВремяОбедПо, Режим)
	
	СтрокаПредставления = "";
	
	Если ЗначениеЗаполнено(ВремяРаботыС) ИЛИ ЗначениеЗаполнено(ВремяРаботыПо) Тогда
		СтрокаПредставления = СтрокаПредставления + Формат(ВремяРаботыС, "ДФ=HH:mm; ДП=00:00")
			+ "-" + Формат(ВремяРаботыПо, "ДФ=HH:mm");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВремяОбедС) ИЛИ ЗначениеЗаполнено(ВремяОбедПо) Тогда
		СтрокаПредставления = СтрокаПредставления + " (обед " + Формат(ВремяОбедС, "ДФ=HH:mm; ДП=00:00")
			+ "-" + Формат(ВремяОбедПо, "ДФ=HH:mm") + ")";
	КонецЕсли;
	
	Возврат СтрокаПредставления;
	
КонецФункции

&НаКлиенте
Процедура ВремяДоставкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбораВремениИДаты(2, Элемент.ТолькоПросмотр);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПолучательВремяПлановойДоставкиОчистка(Элемент, СтандартнаяОбработка)
	
	ВремяДоставкиС = Неопределено;
	ВремяДоставкиПо = Неопределено;
	ВремяДоставкиОбедС = Неопределено;
	ВремяДоставкиОбедПо = Неопределено;
	ПолучательФиксированноеВремя = Неопределено;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПараметрУчастникПеревозки(Префикс)
	
	Результат = Новый Структура;
	
	КонтрагентСсылка = ЭтотОбъект[Префикс + "КонтрагентСсылка"];
	КонтрагентНаименование = ЭтотОбъект[Префикс + "КонтрагентНаименование"];
	КонтрагентЮрФизЛицо = ЭтотОбъект[Префикс + "КонтрагентЮрФизЛицо"];
	КонтрагентИНН = ЭтотОбъект[Префикс + "КонтрагентИНН"];
	КонтрагентЮридическийАдрес = ЭтотОбъект[Префикс + "КонтрагентЮридическийАдресПредставление"];	
	
	ПараметрыКонтрагента = Новый Структура;  
	
	Если Префикс = "Получатель" Тогда
		
		Если ПолучательНовыйПлательщик = 2 И  КонтрагентЮрФизЛицо = 2 Тогда
			
			ДанныеДляЭлектронногоЧека = Новый Структура;			
			
			Если ЗначениеЗаполнено(ПлательщикКонтактноеЛицоEmail) Тогда  
				
				ДанныеДляЭлектронногоЧека.Вставить("email", ПлательщикКонтактноеЛицоEmail);	
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ПлательщикКонтактноеЛицоТелефонДляЧека) Тогда  
				
				ДанныеДляЭлектронногоЧека.Вставить("phone", ПлательщикКонтактноеЛицоТелефонДляЧека);	
				
			КонецЕсли;
			
			Результат.Вставить("dataForReceipt", ДанныеДляЭлектронногоЧека);
			
		КонецЕсли; 		
		
	КонецЕсли; 	
	
	Если КонтрагентЮрФизЛицо = 2 Тогда
		
		ПараметрыКонтрагента.Вставить("form", "0xAB91FEEA04F6D4AD48DF42161B6C2E7A"); 
		
		ПаспортныеДанные = ПолучитьПаспортныеДанные(КонтрагентСсылка);
		
		Если ПаспортныеДанные <> Неопределено Тогда
			
			Паспорт = Новый Структура;
			Паспорт.Вставить("type", "passport");
			Паспорт.Вставить("serial", СтрЗаменить(ПаспортныеДанные.Серия, " ", "")); 
			Паспорт.Вставить("number", ПаспортныеДанные.Номер);
			
			ПараметрыКонтрагента.Вставить("document", Паспорт);  
			
		КонецЕсли;
		
	Иначе 
		            
		ПараметрыКонтрагента.Вставить("form", ДЛ_ДеловыеЛинии.ПолучитьОПФпоИНН(КонтрагентИНН));		
		ПараметрыКонтрагента.Вставить("inn", КонтрагентИНН); 
		
		Если ЗначениеЗаполнено(КонтрагентЮридическийАдрес) Тогда
		
			ПараметрыКонтрагента.Вставить("juridicalAddress", Новый Структура("search", КонтрагентЮридическийАдрес));
			
		КонецЕсли;	
		
	КонецЕсли;
	
	ПараметрыКонтрагента.Вставить("name", КонтрагентНаименование);  		 
	
	Результат.Вставить("counteragent", ПараметрыКонтрагента); 
	
	ДобавитьКонтактноеЛицоИТелефоны(Результат, Префикс);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОтменаДоставки(Команда)
	
	ОтменаОтправкиДоставкиНаСервере("ОтменаДоставки", "Получатель", "грОтменаДоставки");
	
КонецПроцедуры

&НаСервере
Процедура ОтменаОтправкиДоставкиНаСервере(ИмяМетода, Префикс, ИмяГруппы) 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("appkey");
	СтруктураПараметров.Вставить("sessionID");
	СтруктураПараметров.Вставить("orderID", НомерЗаказа);	
	СтруктураПараметров.Вставить("requester", РольОтменяющего);
	
	Если РольОтменяющего = "customer" Тогда
		
		ДобавитьКонтактноеЛицоИТелефоны(СтруктураПараметров, Префикс); 
		
	КонецЕсли;	
	
	Результат = ДЛ_ДеловыеЛинии.ОтменаОтправкиДоставкиНаСервере(СтруктураПараметров, ИмяМетода);
	
	ОбработатьОшибки(Результат["errors"], ИмяГруппы);
	
КонецПроцедуры   

&НаСервере
Процедура ДобавитьКонтактноеЛицоИТелефоны(СтруктураПараметров, Префикс)
	
	КонтактныеЛица = Новый Массив;
	КонтактныеЛица.Добавить(Новый Структура("name", ЭтотОбъект[Префикс + "КонтактноеЛицоНаименование"])); 	  
	
	Телефоны = Новый Массив;  
	
	МассивТелефонов = СтрРазделить(ЭтотОбъект[Префикс + "КонтактноеЛицоТелефонПредставление"], ";");
	ТелефоновДобавлено = 0;
	
	Для Каждого НомерТелефона Из МассивТелефонов Цикл
		
		Если ТелефоновДобавлено = 3 Тогда
			
			Прервать;
			
		КонецЕсли;
		
		НомерТелефонаОчищенный = ТолькоЦифры(НомерТелефона);
		
		Если ЗначениеЗаполнено(НомерТелефонаОчищенный) Тогда
			
			Телефоны.Добавить(Новый Структура("number", НомерТелефонаОчищенный));  
			
			ТелефоновДобавлено = ТелефоновДобавлено + 1;	
			
		КонецЕсли;
		
	КонецЦикла; 
	
	СтруктураПараметров.Вставить("contactPersons", КонтактныеЛица);
	СтруктураПараметров.Вставить("phoneNumbers", Телефоны); 	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТолькоЦифры(Знач СтрокаДляПроверки)
	
	ЛишниеСимволы = СтрСоединить(СтрРазделить(СтрокаДляПроверки, "0123456789"), "");
	Результат     = СтрСоединить(СтрРазделить(СтрокаДляПроверки, ЛишниеСимволы), "");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОтменаОтправки(Команда) 
	
	ОтменаОтправкиДоставкиНаСервере("ОтменаОтправки", "Отправитель", "грОтменаЗабора");
	
КонецПроцедуры

&НаСервере
Процедура ПриостановкаВыдачиНаСервере()
	
	Результат = ДЛ_ДеловыеЛинии.ПриостановкаВыдачи(НомерЗаказа, ДатаПриостановки);	 
	
	ОбработатьОшибки(Результат["errors"], "грПриостановка");		
	
КонецПроцедуры  

&НаСервере
Процедура ОбработатьОшибки(Ошибки, ИмяГруппы = "")
	
	Если Ошибки = Неопределено Тогда 
		
		Если ЗначениеЗаполнено(ИмяГруппы) Тогда		
			
			Элементы[ИмяГруппы].Видимость = Ложь;			
			
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрос успешно отправлен"); 		
		
	Иначе      
		
		Если ТипЗнч(Ошибки) = Тип("Массив") Тогда
			
			Для Каждого Ошибка Из Ошибки Цикл			
		
				ВывестиСообщениеОбОшибке(Ошибка);
				
			КонецЦикла;	
			
		ИначеЕсли ТипЗнч(Ошибки) = Тип("Строка") Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ошибки);				
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры	   


&НаСервере
Процедура ВывестиСообщениеОбОшибке(Ошибка) 
	
	Сообщение = "";  
	
	Если ТипЗнч(Ошибка["fields"]) = Тип("Массив") И Ошибка["fields"].Количество() > 0 Тогда
		
		ПолеСОшибкой = Ошибка["fields"][0];	
		
		Если Ошибка["title"] = "Отсутствует обязательный параметр" Тогда 
			
			Если ПолеСОшибкой = "receiver.counteragent.form" Или ПолеСОшибкой = "receiver.counteragent.name" Тогда
				
				Сообщение = "Не заполнен получатель";	
				
			ИначеЕсли ПолеСОшибкой = "receiver.counteragent.inn" Тогда
				
				Сообщение = "Не заполнен ИНН получателя";
				
			ИначеЕсли ПолеСОшибкой = "receiver.contactPersons.contactPerson.name" Тогда
				
				Сообщение = "Не заполнено контактное лицо получателя";	 
				
			ИначеЕсли ПолеСОшибкой = "receiver.phoneNumbers" Тогда
				
				Сообщение = "Не заполнены контактные телефоны получателя";	
				
			КонецЕсли;
			
		ИначеЕсли Ошибка["title"] = "По данному заказу изменение получателя недоступно" Тогда 
			
			Сообщение = Ошибка["title"]; 
			
		ИначеЕсли Ошибка["title"] = "Ошибка выполнения запроса" Тогда
			
			Если ПолеСОшибкой = "members.receiver" Тогда
				
				Сообщение = "Невозможно внести изменения Получателя";
				
			КонецЕсли;	
			
		ИначеЕсли Ошибка["title"] = "По данному заказу отмена доставки груза до адреса недоступна" 
			Или Ошибка["title"] = "Указан некорректный документ, удостоверяющий личность" Тогда 
			
			Сообщение = Ошибка["detail"];
			
		ИначеЕсли Ошибка["title"] = "Недопустимое значение параметра" Тогда
			
			Если ПолеСОшибкой = "address.search" Тогда
				
				Сообщение = "Смена адреса отправки возможна только в пределах указанного ранее региона";

			КонецЕсли;
			
		ИначеЕсли Ошибка["title"] = "Неверный формат параметра" Тогда  
			
			Если ПолеСОшибкой = "members.sender.phoneNumbers.phoneNumber.number" Тогда
				
				Сообщение = "Укажите номер телефона Отправителя в формате +79XXXXXXXXX";							
				
			КонецЕсли;	
			
		ИначеЕсли Ошибка["title"] = "Ошибка типизации" Тогда
			
			Если ПолеСОшибкой = "members.sender.phoneNumbers.phoneNumber.number" Тогда
				
				Сообщение = "Убедитесь, что в номере телефона Отправителя не больше 15 символов.";							
				
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Сообщение) Тогда 
		
		Сообщение = СтрШаблон("Ошибка: %1
			|Описание: %2
			|Поле запроса: %3",
			Ошибка["title"],
			Ошибка["detail"],
			ПолеСОшибкой);		
		
	КонецЕсли; 
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
	
КонецПроцедуры  	

&НаКлиенте
Процедура ПриостановкаВыдачи(Команда) 
	
	ПриостановкаВыдачиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВозобновлениеВыдачиНаСервере()
	
	Результат = ДЛ_ДеловыеЛинии.ВозобновлениеВыдачи(НомерЗаказа, ДатаВозобновления);
	
	ОбработатьОшибки(Результат["errors"], "грВозобновление");
	
КонецПроцедуры

&НаКлиенте
Процедура ВозобновлениеВыдачи(Команда) 
	
	ВозобновлениеВыдачиНаСервере(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательНовыйПлательщикПриИзменении(Элемент)
	
	Если ПолучательНовыйПлательщик И ПолучательКонтрагентЮрФизЛицо = 2 Тогда
		
		Элементы.ГруппаЭлектронныйЧек.Видимость = Истина;
		
	Иначе
		
		Элементы.ГруппаЭлектронныйЧек.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПаспортныеДанные(КонтрагентСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДокументыФизическихЛицСрезПоследних.Серия КАК Серия,
	|	ДокументыФизическихЛицСрезПоследних.Номер КАК Номер
	|ИЗ
	|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
	|			,
	|			Физлицо = &Физлицо
	|				И ВидДокумента = &ВидДокумента) КАК ДокументыФизическихЛицСрезПоследних"; 
	Запрос.УстановитьПараметр("Физлицо", КонтрагентСсылка);
	Запрос.УстановитьПараметр("ВидДокумента", Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		Возврат Результат.Выгрузить()[0];
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ИзменитьКонтактнуюИнформациюНаСервере(Префикс, ИмяГруппы)

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("appkey");
	СтруктураПараметров.Вставить("sessionID");
	СтруктураПараметров.Вставить("orderID", НомерЗаказа);
	
	СтруктураКонтакты = Новый Структура;
	ДобавитьКонтактноеЛицоИТелефоны(СтруктураКонтакты, Префикс);
	
	КлючУчастника = ?(Префикс = "Отправитель", "sender", "receiver");
	
	СтруктураПараметров.Вставить("members", Новый Структура(КлючУчастника, СтруктураКонтакты));	 
	
	Результат = ДЛ_ДеловыеЛинии.ИзменитьКонтактнуюИнформацию(СтруктураПараметров);
	
	ОбработатьОшибки(Результат["errors"], ИмяГруппы);	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКонтактнуюИнформациюОтправителя(Команда) 
	
	ИзменитьКонтактнуюИнформациюНаСервере("Отправитель", "грКонтактнаяИнформацияОтправитель");   
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКонтактнуюИнформациюПолучателя(Команда)
	
	ИзменитьКонтактнуюИнформациюНаСервере("Получатель", "грКонтактнаяИнформацияПолучатель");

КонецПроцедуры

&НаСервере
Процедура ИзменитьПараметрыЗабораНаСервере()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("appkey");
	СтруктураПараметров.Вставить("sessionID");
	СтруктураПараметров.Вставить("orderID", НомерЗаказа);
	СтруктураПараметров.Вставить("variant", "address"); 
	СтруктураПараметров.Вставить("address", Новый Структура("search", ОтправительАдресПредставление));
	СтруктураПараметров.Вставить("produce_date", Формат(ДатаОтгрузки, "ДФ='гггг-ММ-дд'"));
	СтруктураПараметров.Вставить("time", ЗаполнитьПараметрВремя("Отгрузки"));
	
	ДобавитьКонтактноеЛицоИТелефоны(СтруктураПараметров, "Отправитель");
	
	Результат = ДЛ_ДеловыеЛинии.ИзменитьПараметрыЗабора(СтруктураПараметров);
	
	ОбработатьОшибки(Результат["errors"], "грАдресВремяЗабора");
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПараметрыЗабора(Команда) 
	
	ИзменитьПараметрыЗабораНаСервере(); 
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПараметрВремя(ИдентификаторРеквизита)  

	Результат = Новый Структура;	
	Результат.Вставить("worktimeStart", Формат(ЭтаФорма["Время" + ИдентификаторРеквизита + "С"], "ДФ='ЧЧ:мм'"));
	Результат.Вставить("worktimeEnd", Формат(ЭтаФорма["Время" + ИдентификаторРеквизита + "По"], "ДФ='ЧЧ:мм'"));
	
	Если ЗначениеЗаполнено(ЭтаФорма["Время" + ИдентификаторРеквизита + "ОбедС"]) И 
		ЗначениеЗаполнено(ЭтаФорма["Время" + ИдентификаторРеквизита + "ОбедПо"]) Тогда
	
		Результат.Вставить("breakStart", Формат(ЭтаФорма["Время" + ИдентификаторРеквизита + "ОбедС"], "ДФ='ЧЧ:мм'"));
		Результат.Вставить("breakEnd", Формат(ЭтаФорма["Время" + ИдентификаторРеквизита + "ОбедПо"], "ДФ='ЧЧ:мм'"));
		
	КонецЕсли;	
	
	Результат.Вставить("exactTime", ЭтаФорма[?(ИдентификаторРеквизита = "Отгрузки", "Отправитель", "Получатель") + "ФиксированноеВремя"]);		
	
	Возврат Результат;
	
КонецФункции 

&НаСервере
Процедура ИзменитьПараметрыДоставкиНаСервере()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("appkey");
	СтруктураПараметров.Вставить("sessionID");
	СтруктураПараметров.Вставить("orderID", НомерЗаказа);	  	
	СтруктураПараметров.Вставить("members", Новый Структура("requester", Новый Структура("role", ИнициаторИзмененийДоставки)));  
	
	Если ИнициаторИзмененийДоставки = "sender" Тогда  
		
		СтруктураПараметров.Вставить("storePayer", ОтветственныйЗаХранение);
		
	КонецЕсли;
	
	СтруктураИзменяемыхПараметров = Новый Структура; 
	СтруктураИзменяемыхПараметров.Вставить("variant", ?(ДоставкаДоАдреса, "address", "terminal"));
	
	Если ДоставкаДоАдреса Тогда 
		
		СтруктураИзменяемыхПараметров.Вставить("address", Новый Структура("search", ПолучательАдресПредставление));	  
		
		Если ЗначениеЗаполнено(ВремяДоставкиС) И ЗначениеЗаполнено(ВремяДоставкиПо) Тогда 
		
			СтруктураИзменяемыхПараметров.Вставить("time", ЗаполнитьПараметрВремя("Доставки"));  
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДатаДоставки) Тогда
			
			СтруктураИзменяемыхПараметров.Вставить("produceDate", Формат(ДатаДоставки, "ДФ='гггг-ММ-дд'"));				
			
		КонецЕсли;
		
	Иначе    
		
		СтруктураИзменяемыхПараметров.Вставить("terminalID", Число(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПолучательТерминал, "ИДтерминала")));
		
	КонецЕсли; 	
	
	СтруктураПараметров.Вставить("delivery", Новый Структура("arrival", СтруктураИзменяемыхПараметров));  
	
	Результат = ДЛ_ДеловыеЛинии.ИзменитьПараметрыДоставки(СтруктураПараметров);
	
	ОбработатьОшибки(Результат["errors"], "грАдресВремяДоставки");
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПараметрыДоставки(Команда)  
	
	ИзменитьПараметрыДоставкиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательКонтрагентОчистка(Элемент, СтандартнаяОбработка)
	
	ПолучательКонтактноеЛицоНаименование = "";
	ПолучательКонтактноеЛицоТелефонПредставление = ""; 
	ПолучательКонтрагентИНН = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикКонтрагентОчистка(Элемент, СтандартнаяОбработка)
	
	ПлательщикКонтактноеЛицоНаименование = "";
	ПлательщикКонтактноеЛицоТелефонПредставление = "";  
	ПлательщикКонтрагентИНН = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РольОтменяющего = "customer";
	
КонецПроцедуры

&НаКлиенте
Процедура РольОтменяющегоПриИзменении(Элемент)  
	
	ВидимостьКонтактногоЛица = РольОтменяющего = "customer";
	
	Элементы.Заказчик_КонтактноеЛицо.Видимость = ВидимостьКонтактногоЛица;
	Элементы.Заказчик_КонтактноеЛицоТелефон.Видимость = ВидимостьКонтактногоЛица;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициаторИзмененийДоставкиПриИзменении(Элемент)
	
	Элементы.ОтветственныйЗаХранение.Видимость = (ИнициаторИзмененийДоставки = "sender");
	
КонецПроцедуры
